# Learning Machine Learning with Python

Checking matplotlib

In [ ]:
%matplotlib widget
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import mglearn
from IPython.display import display

# Generate numbers from -10 to 10 with 100 steps

x = np.linspace(-10,10,100)

# Array sine 

y = np.sin(x)

# Chart of the two

plt.plot(x,y,marker="x")

SyntaxError: invalid syntax (1278701883.py, line 2)

# Pandas

Pandas is a library for data analysis. It's modelled after R's DataFrame, which is similiar to Excel's spreadsheet. It allows SQL-Like queries, and joins of the tables.

In [4]:
import pandas as pd
#Data set
data = {'Name': ["John","Anna","Peter","Linda"],
        'Location': ["Warsaw","Berlin","Tokyo","Amsterdam"],
        'Age': [34,21,46,73]
        }

data_panda = pd.DataFrame(data)

# Display
display(data_panda)

    Name   Location  Age
0   John     Warsaw   34
1   Anna     Berlin   21
2  Peter      Tokyo   46
3  Linda  Amsterdam   73

Querying the table - select the rows with age greater than 35

In [5]:
display(data_panda[data_panda.Age > 35])

    Name   Location  Age
2  Peter      Tokyo   46
3  Linda  Amsterdam   73